MobileOTPIntegration/src/main/resources/submitOTPRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:submitOTPRequest>
            <us:otp>1234</us:otp>
            <us:phoneNumber>9824286537</us:phoneNumber>
            <us:transactionId>transactionId_0001</us:transactionId>
        </us:submitOTPRequest>
    </soapenv:Body>
</soapenv:Envelope>